{"id":"43f3c381-871f-4466-966c-e18affd3fef7","updated_at":"2025-06-19T15:07:48.443Z","updated_by":"elastic","created_at":"2025-06-19T15:07:48.443Z","created_by":"elastic","name":"NOS3 DISABLE_CC ALERT","tags":[],"interval":"30m","enabled":true,"revision":0,"description":"NOS3 DISABLE_CC ALERT","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"http://localhost:5601/app/security"},"author":[],"false_positives":[],"from":"now-1860s","rule_id":"5fe4f132-0185-4bc8-a6e6-ca25aba6429f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"aa68fe1b-0bc7-4ae1-8cbe-c2f73a90113f","query":"log.type: \"cosmos-cmd\" and cosmos.cmd.cmd : *DISABLE_CC*","filters":[],"actions":[{"id":"9778c8ab-8da5-45b8-8bb7-8ae6ece16d62","params":{"level":"info","message":"Rule {{context.rule.name}} generated {{state.signals_count}} alerts"},"action_type_id":".server-log","uuid":"ded1a205-b4cf-45fb-9c0f-8f4236716b31","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null},"group":"default"}]}
{"id":"9778c8ab-8da5-45b8-8bb7-8ae6ece16d62","type":"action","updated_at":"2025-03-05T15:16:03.705Z","created_at":"2025-03-05T15:16:03.705Z","version":"WzEsOV0=","attributes":{"actionTypeId":".server-log","name":"Monitoring: Write to Kibana log","isMissingSecrets":false,"config":{},"secrets":{}},"references":[],"managed":false,"coreMigrationVersion":"8.8.0","typeMigrationVersion":"10.1.0"}
{"exported_count":2,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":1,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
